app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('Example User', 'user@example.com', '2017-04-25 20:28:22', '2017-04-25 20:28:22', '$2a$04$L2pP82malrHqBR373YBLyeG1Iqs.UCvB7CEfUNwwIepfpckQs.kKm')
---
  def create
    @user = User.new(user_params)    # Not the final implementation!
    if @user.save